DataProcessors/упЗагрузкаДанныхОтТопливныхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упЗагрузкаДанныхОтТопливныхКомпаний</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/упТопливныеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТопливныеКомпании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лукойл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роснефть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упРейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упРейс</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УдалитьупОстаткиДокументовПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упПрерыванияГрузовыхПотоков</xr:Item>
				<xr:Item>AccumulationRegister.упНепереданныеДокументы</xr:Item>
				<xr:Item>InformationRegister.упРасписаниеРаботыТС</xr:Item>
				<xr:Item>InformationRegister.упПланПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упМаршрутПоРейсу</xr:Item>
				<xr:Item>AccumulationRegister.упВыработкаСотрудников</xr:Item>
				<xr:Item>InformationRegister.упСостоянияТранспортныхСредств</xr:Item>
				<xr:Item>InformationRegister.упОтветыНаЗапросыМобильныйКлиент</xr:Item>
				<xr:Item>InformationRegister.упПеревозчикПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>InformationRegister.упРасписаниеРаботыЭкипажей</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаданийНаПеревозкуГруза</xr:Item>
				<xr:Item>AccumulationRegister.упЗаданияКПланированию</xr:Item>
				<xr:Item>InformationRegister.упФактическиеМестоположенияТС</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьСотрудников</xr:Item>
				<xr:Item>InformationRegister.упДополнительныеСотрудникиРейса</xr:Item>
				<xr:Item>AccumulationRegister.упРасходыНаТС</xr:Item>
				<xr:Item>InformationRegister.упРаботыПоРейсу</xr:Item>
				<xr:Item>AccumulationRegister.упРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспортныхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКоэффициентЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеМаршрутизатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОграниченияМаршрутизаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозкаТранспортнойКомпанией</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокИсполненияЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упПорядокИсполненияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРасписанияПериодическихРейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийКоэффициентЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусWMS</Name>
					<Comment>Статусы WMS хранятся в отдельном регистре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскиеВорота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСкладскиеВорота</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОптимизацияМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГрузов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлановыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/упЗагрузкаДанныхОтТопливныхКомпаний/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчика;

&НаКлиенте
Перем ПодтверждениеЗакрытияФормы;

&НаКлиенте
Перем ФормаДлительнойОперации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТопливнаяКомпания = Перечисления.упТопливныеКомпании.ЗначениеПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаАктивностейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТаблицаАктивностейСотрудник" Тогда
		Строка = ТаблицаДанныхПоТопливу.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если НЕ Строка = Неопределено Тогда
			Ключ = Строка["Сотрудник"];
			Если ЗначениеЗаполнено(Ключ) Тогда
				ПараметрыФормы = Новый Структура("Ключ", Ключ);
				ОткрытьФорму("Справочник.упСотрудники.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ТаблицаАктивностейРейс" Тогда	
		Строка = ТаблицаДанныхПоТопливу.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если НЕ Строка = Неопределено Тогда
			Ключ = Строка["Рейс"];
			Если ЗначениеЗаполнено(Ключ) Тогда
				ПараметрыФормы = Новый Структура("Ключ", Ключ);
				ОткрытьФорму("Документ.упРейс.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Команда)
	ЗагрузитьДанныеИзФайлаКлиент(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуИзФайла(Команда)
	ЗагрузитьДанныеИзФайлаКлиент(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для каждого Строка Из ТаблицаДанныхПоТопливу Цикл
		Строка.Флаг = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого Строка Из ТаблицаДанныхПоТопливу Цикл
		Строка.Флаг = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьТопливныеКарты(Команда)
	
	Если ПолучитьПомеченныеДанные() Тогда
		мсвТаблицаСопоставленияТопливныхКарт = ТаблицаСопоставленияТопливныхКарт();
		ПараметрыФормы = Новый Структура("ТопливныеКарты", мсвТаблицаСопоставленияТопливныхКарт);
		ОбработчикЗакрытияФормы = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСопоставленияТопливныхКарт", ЭтаФорма);
		ОткрытьФорму("Обработка.упЗагрузкаДанныхОтТопливныхКомпаний.Форма.ФормаСопоставленияТопливныхКарт", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,ОбработчикЗакрытияФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьГСМ(Команда)
	Если ПолучитьПомеченныеДанные() Тогда
		мсвТаблицаСопоставления = ТаблицаСопоставленияГСМ();
		ПараметрыФормы = Новый Структура("ГСМ", мсвТаблицаСопоставления);
		ОбработчикЗакрытияФормы = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСопоставленияГСМ", ЭтаФорма);
		ОткрытьФорму("Обработка.упЗагрузкаДанныхОтТопливныхКомпаний.Форма.ФормаСопоставленияГСМ", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,ОбработчикЗакрытияФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьВалюту(Команда)
	Если ПолучитьПомеченныеДанные() Тогда
		мсвТаблицаСопоставления = ТаблицаСопоставленияВалюты();
		ПараметрыФормы = Новый Структура("Валюты", мсвТаблицаСопоставления);
		ОбработчикЗакрытияФормы = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСопоставленияВалют", ЭтаФорма);
		ОткрытьФорму("Обработка.упЗагрузкаДанныхОтТопливныхКомпаний.Форма.ФормаСопоставленияВалют", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,ОбработчикЗакрытияФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВРегистр(Команда)
	ЗагрузитьДанныеВРегистрКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВРегистрИЗакрытьФорму(Команда)
	ЗагрузитьДанныеВРегистрКлиент(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Функция ПолучитьПомеченныеДанные()

	Результат = Истина;
	НайденныеСтроки = ТаблицаДанныхПоТопливу.НайтиСтроки(Новый Структура("Флаг", Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = Нстр("ru = 'Установите флаг(пометку) в строках для сопоставления данных.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолучитьПомеченныеДанные()

&НаКлиенте
Процедура ЗагрузитьДанныеВРегистрКлиент(ЗакрытьФорму = Ложь)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	
	// Проверка таблицы
	Сч = 1;
	Для каждого Строка Из ТаблицаДанныхПоТопливу Цикл
		Если Строка.Флаг Тогда
			Если НЕ ЗначениеЗаполнено(Строка.ТопливнаяКарта) Тогда
				ТекстСообщения = Нстр("ru = 'Не заполнена топливная карта. Используйте команды сопоставления.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаДанныхПоТопливу", Сч, "ТопливнаяКарта"),, Отказ);
			ИначеЕсли НЕ ЗначениеЗаполнено(Строка.ВидГСМ) Тогда	
				ТекстСообщения = Нстр("ru = 'Не заполнен вид ГСМ. Используйте команды сопоставления.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаДанныхПоТопливу", Сч, "ВидГСМ"),, Отказ);
			ИначеЕсли НЕ ЗначениеЗаполнено(Строка.Валюта) Тогда	
				ТекстСообщения = Нстр("ru = 'Не заполна валюта. Используйте команды сопоставления.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаДанныхПоТопливу", Сч, "Валюта"),, Отказ);	
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;

	// Загрузка данных
	Если НЕ Отказ Тогда
		ЗагрузитьДанныеВРегистрНаСервере(ТекстОшибки, Отказ);	
		Если Отказ Тогда
			упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);	
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ И ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончаниеПомещенияФайла(Результат, АдресВременногоХранилища, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат = Истина Тогда
		Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ВыбранноеИмяФайла));
		ТекущееРасширение = "xml";
		Если ТопливнаяКомпания = ПредопределенноеЗначение("Перечисление.упТопливныеКомпании.Роснефть") Тогда
			ТекущееРасширение = "xls";
		КонецЕсли;
		Если Расширение = ТекущееРасширение Тогда
			ФоновоеЗадание 	= Ложь;
			ТекстСообщения		= "";
			ЗагрузитьДанныеФайлаНаСервере(АдресВременногоХранилища, Расширение, ФоновоеЗадание, ТекстСообщения);
			Если ФоновоеЗадание Тогда
				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
				ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
				ПараметрыОбработчика.МаксимальныйИнтервал = 5;
				ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ФоновоеЗаданиеИдентификатор);
			КонецЕсли;	
			Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстСообщения, Истина);
			КонецЕсли;
		Иначе
			ТекстСообщения = СтрШаблон(Нстр("ru = 'Выбранный тип файла не поддерживается. Выберите файл с расширением %1'"), ТекущееРасширение);
			упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстСообщения, Истина);
		КонецЕсли;
	КонецЕсли;	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаКлиент(ОткрыватьДиалогВыбора = Истина)
	
	Если ОткрыватьДиалогВыбора Тогда
		Интерактивно 	= Истина;
		ПолноеИмяФайла 	= "";	
		Если ПодключитьРасширениеРаботыСФайлами() Тогда
			ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Если ТопливнаяКомпания = ПредопределенноеЗначение("Перечисление.упТопливныеКомпании.Роснефть") Тогда
				ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Данные по топливу (*.xls)|*.xls'");
			Иначе
				ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Данные по топливу (*.xml)|*.xml'");
			КонецЕсли;
			ДиалогВыбораФайла.Заголовок                   = Заголовок;
			ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
			ДиалогВыбораФайла.Расширение                  = "";
			ДиалогВыбораФайла.ИндексФильтра               = 0;
			ДиалогВыбораФайла.ПолноеИмяФайла              = "";
			ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
			
			Если ДиалогВыбораФайла.Выбрать() Тогда
				ПолноеИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
			КонецЕсли;
			
			ВыбранныйФайл 	= ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайла);
			Если ЗначениеЗаполнено(ВыбранныйФайл.Имя) Тогда
				ПолноеИмяФайла = ВыбранныйФайл.ПолноеИмя;
				Интерактивно = Ложь;
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Интерактивно 	= Ложь;
	КонецЕсли;
	АдресВременногоХранилища = "";
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПриОкончаниеПомещенияФайла", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещенияОЗавершении, АдресВременногоХранилища, ПолноеИмяФайла, Интерактивно);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеФайлаНаСервере(АдресВременногоХранилища, Расширение, ФоновоеЗадание, ТекстСообщения)

	ИмяВременногоФайла	= ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные 		= ПолучитьИЗВременногоХранилища(АдресВременногоХранилища);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ПараметрыВызоваСервера = Новый Структура();
	ПараметрыВызоваСервера.Вставить("ИмяВременногоФайла", 			ИмяВременногоФайла);
	ПараметрыВызоваСервера.Вставить("ТопливнаяКомпания", 			ТопливнаяКомпания);
	СхемаКомпоновки = Неопределено;
	Если ТопливнаяКомпания = Перечисления.упТопливныеКомпании.Лукойл Тогда
		СхемаКомпоновки = Обработки.упЗагрузкаДанныхОтТопливныхКомпаний.ПолучитьМакет("ДанныеЛукойл");
	КонецЕсли;
	ПараметрыВызоваСервера.Вставить("СхемаДанныеТопливнойКомпании", СхемаКомпоновки);	
	ПараметрыВызоваСервера.Вставить("НастройкиСхемыДанных", 		Неопределено);
	
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Обработки.упЗагрузкаДанныхОтТопливныхКомпаний.ЗагрузитьДанныеИзФайла",
	ПараметрыВызоваСервера, 
	НСтр("ru = 'Подсистема ЗагрузкаДанныхИзФайла: Выполнение серверного метода загрузка данных из файла'"));
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		сткДанныеИзТахографа = ПолучитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресХранилища);
		ТекстСообщения = сткДанныеИзТахографа.ТекстОшибки;
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ЗаполнитьДанныеФормыНаСервере(сткДанныеИзТахографа);
		КонецЕсли;
	Иначе
		ФоновоеЗадание = Истина;
		ФоновоеЗаданиеИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	Результат = ФоновоеЗаданиеЗагрузкаФайлаПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ФоновоеЗаданиеИдентификатор Тогда
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		сткДанныеИзТахографа = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		Если сткДанныеИзТахографа.Свойство("ТекстОшибки") И НЕ ПустаяСтрока(сткДанныеИзТахографа.ТекстОшибки) Тогда
			упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(сткДанныеИзТахографа.ТекстОшибки, Истина);
		КонецЕсли;
		ЗаполнитьДанныеФормыНаСервере(сткДанныеИзТахографа);
		УстановитьДоступность();
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗагрузкаФайлаПолучитьРезультат()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеФормыНаСервере(сткДанныеТахографа)
	
	Сотрудник 	= Справочники.упСотрудники.ПустаяСсылка();
	НомерКарты	= "";
	ИмяВодителя	= "";
	ФамилияВодителя		= "";
	ОрганВыдавшийКарту	= "";
	ДатаВыпускаКарты 			= '00010101';
	ДатаНачалаДействияКарты 	= '00010101';
	ДатаОкончанияДействияКарты 	= '00010101';
	ТаблицаДанныхПоТопливу.Очистить();
		
	//	ЗаполнитьЗначенияСвойств(ЭтаФорма, сткДанныеТахографа.ДанныеИдентификации);
	//	Сотрудник		= сткДанныеТахографа.Сотрудник;
	//	КартаТахографа	= сткДанныеТахографа.КартаТахографа;
	
	//	Если ЗначениеЗаполнено(Сотрудник)
	//		И ЗначениеЗаполнено(КартаТахографа) Тогда
	//		СопоставленныйСотрудник = Сотрудник;
	//КонецЕсли;
	
	Для каждого Строка Из сткДанныеТахографа.ТаблицаДанныхПоТопливу Цикл
		НоваяСтрока = ТаблицаДанныхПоТопливу.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.ОбновитьТаблицуИзФайла.Доступность 				= ЗначениеЗаполнено(ПолноеИмяФайла);
	//Элементы.ТаблицаДанныхСопоставитьВодителей.Доступность = ЗначениеЗаполнено(Сотрудник) 
	//																И НЕ СопоставленныйСотрудник = Сотрудник;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВРегистрНаСервере(ТекстОшибки, Отказ)
	Обработки.упЗагрузкаДанныхОтТопливныхКомпаний.ЗаписатьДанныеВРегистр(ТаблицаДанныхПоТопливу.Выгрузить(), ТекстОшибки, Отказ);
КонецПроцедуры

&НаСервере
Функция ТаблицаСопоставленияТопливныхКарт()
	мсвРезультат = Неопределено;
	
	тбзТопливныеКарты = ТаблицаДанныхПоТопливу.Выгрузить(Новый Структура("Флаг", Истина),"ТопливнаяКомпания, ТопливнаяКартаНомер, ВладелецКарты, ТопливнаяКарта, Сотрудник, ТранспортноеСредство");
	тбзТопливныеКарты.Свернуть("ТопливнаяКомпания, ТопливнаяКартаНомер, ВладелецКарты, ТопливнаяКарта, Сотрудник, ТранспортноеСредство");
	
	мсвРезультат = ОбщегоНазначения.ТаблицаЗначенийВМассив(тбзТопливныеКарты);
	
	Возврат мсвРезультат;
	
КонецФункции

&НаСервере
Функция ТаблицаСопоставленияВалюты()
	мсвРезультат = Неопределено;
	
	тбзВалюты = ТаблицаДанныхПоТопливу.Выгрузить(Новый Структура("Флаг", Истина),"ВалютаЦифровойКод, Валюта");
	тбзВалюты.Свернуть("ВалютаЦифровойКод, Валюта");
	
	мсвРезультат = ОбщегоНазначения.ТаблицаЗначенийВМассив(тбзВалюты);
	
	Возврат мсвРезультат;
	
КонецФункции

&НаСервере
Функция ТаблицаСопоставленияГСМ()
	мсвРезультат = Неопределено;
	
	тбзГСМ = ТаблицаДанныхПоТопливу.Выгрузить(Новый Структура("Флаг", Истина),"ВидГСМНаименование, ГСМНаименование, ГСМ, ВидГСМ");
	тбзГСМ.Свернуть("ВидГСМНаименование, ГСМНаименование, ГСМ, ВидГСМ");
	
	мсвРезультат = ОбщегоНазначения.ТаблицаЗначенийВМассив(тбзГСМ);
	
	Возврат мсвРезультат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСопоставленияГСМ(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		Для каждого Строка Из РезультатЗакрытия Цикл
			Если ЗначениеЗаполнено(Строка.ВидГСМ) Тогда
				мсвСтрокиДанныхПоТопливу = ТаблицаДанныхПоТопливу.НайтиСтроки( Новый Структура("ВидГСМНаименование", Строка.ВидГСМНаименование));	
				Для каждого СтрокаДанныхПоТопливу Из мсвСтрокиДанныхПоТопливу Цикл
					ЗаполнитьЗначенияСвойств(СтрокаДанныхПоТопливу, Строка, "ВидГСМ");
				КонецЦикла;
			КонецЕсли;
			Если ЗначениеЗаполнено(Строка.ГСМ) Тогда
				мсвСтрокиДанныхПоТопливу = ТаблицаДанныхПоТопливу.НайтиСтроки( Новый Структура("ГСМНаименование", Строка.ГСМНаименование));	
				Для каждого СтрокаДанныхПоТопливу Из мсвСтрокиДанныхПоТопливу Цикл
					ЗаполнитьЗначенияСвойств(СтрокаДанныхПоТопливу, Строка, "ГСМ");
				КонецЦикла;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСопоставленияВалют(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		Для каждого Строка Из РезультатЗакрытия Цикл
			Если ЗначениеЗаполнено(Строка.Валюта) Тогда
				мсвСтрокиДанныхПоТопливу = ТаблицаДанныхПоТопливу.НайтиСтроки( Новый Структура("ВалютаЦифровойКод", Строка.ВалютаЦифровойКод));	
				Для каждого СтрокаДанныхПоТопливу Из мсвСтрокиДанныхПоТопливу Цикл
					ЗаполнитьЗначенияСвойств(СтрокаДанныхПоТопливу, Строка, "Валюта");
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСопоставленияТопливныхКарт(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		Для каждого Строка Из РезультатЗакрытия Цикл
			Если ЗначениеЗаполнено(Строка.ТопливнаяКарта) Тогда
				мсвСтрокиДанныхПоТопливу = ТаблицаДанныхПоТопливу.НайтиСтроки( Новый Структура("ТопливнаяКартаНомер", Строка.ТопливнаяКартаНомер));	
				Для каждого СтрокаДанныхПоТопливу Из мсвСтрокиДанныхПоТопливу Цикл
					ЗаполнитьЗначенияСвойств(СтрокаДанныхПоТопливу, Строка, "ТопливнаяКарта, Сотрудник, ТранспортноеСредство");
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
